; domain
(define (domain shakey)
    (:requirements :strips :typing :equality)
    (:types room shakey box)
    (:predicates (shakey-at ?s - shakey ?x - room) ;Donde esta shakey
                 (box-at ?b - box ?x - room) ;Donde esta el objeto
                 (over-box ?s - shakey ?b - box) ;Shakey esta encima de la caja
                 (lighted-room ?x - room) ;La luz de la habitacion esta encendida
                 ;(door-open ?x - room)
                 (adjoining ?x ?y - room) ;Determina si dos habitaciones estan contiguas
                 )
    
    ;Shakey se mueve de un lugar x a un lugar y
    (:action move 
        :parameters (?x - room ?y - room ?s - shakey)
        :precondition (and (shakey-at ?s ?x) 
                           (not (= ?x ?y))
                           (or (adjoining ?x ?y) 
                           (adjoining ?y ?x))
                           )
        :effect (and (shakey-at ?s ?y) 
                     (not(shakey-at ?s ?x)))              
    
    )
    
    ;Shakey empuja un objeto desde x hasta un lugar y
    (:action push
        :parameters (?x - room ?y - room ?b - box ?s - shakey)
        :precondition (and (shakey-at ?s ?x)
                           (box-at ?b ?x)
                           (not (= ?x ?y))
                           (or (adjoining ?x ?y) 
                           (adjoining ?y ?x))
                           )
        :effect (and (box-at ?b ?y)
                     (shakey-at ?s ?y)
                     (not (box-at ?b ?x))
                     (not (shakey-at ?s ?x)))
    )
    
    ;Shakey sube a una caja
    (:action climb-up
        :parameters (?s - shakey ?b - box ?x - room)
        :precondition (and (shakey-at ?s ?x)
                            (box-at ?b ?x)
                            (not (over-box ?s ?b)))
        :effect (over-box ?s ?b)
    )
    
    ;Shakey baja de una caja
    (:action climb-down
        :parameters (?s - shakey ?b - box ?x - room)
        :precondition (and (shakey-at ?s ?x)
                            (box-at ?b ?x)
                            (over-box ?s ?b))
        :effect (not (over-box ?s ?b))
    )
    
    ;Shakey enciende la luz de una habitacion
    (:action switch-on
        :parameters (?s - shakey ?b - box ?x - room)
        
        ;Para poder encender la luz shakey debe estar encima de una caja
        :precondition (and (over-box ?s ?b)
                           (not (lighted-room ?x))
                           (shakey-at ?s ?x))
        :effect (lighted-room ?x)
    )
    
    (:action switch-off
        :parameters (?s - shakey ?b - box ?x - room)
        
        ;Para poder apagar la luz shakey debe estar encima de una caja
        :precondition (and (over-box ?s ?b)
                           (lighted-room ?x))
        :effect (not (lighted-room ?x))
    )
    
)

; problem
(define (problem shakey-problem)
    (:domain shakey)
    (:objects r1 r2 r3 r4 lobby - room
              b1 - box
              s - shakey 
    )
    
    (:init  (adjoining r1 lobby)
            (adjoining r2 lobby)
            (adjoining r3 lobby)
            (adjoining r4 lobby)
            (shakey-at s r1)
            (box-at b1 r3)
    )
    
    (:goal (and (lighted-room r3) 
                (lighted-room r2)
                (lighted-room r4))
    )
)

; plan
1. (move r1 lobby s)
   deleted: (shakey-at s r1)
   added: (shakey-at s lobby)
   goals met: 0 of 3
2. (move lobby r3 s)
   deleted: (shakey-at s lobby)
   added: (shakey-at s r3)
   goals met: 0 of 3
3. (climb-up s b1 r3)
   added: (over-box s b1)
   goals met: 0 of 3
4. (switch-on s b1 r3)
   added: (lighted-room r3)
   goals met: 1 of 3
5. (move r3 lobby s)
   deleted: (shakey-at s r3)
   added: (shakey-at s lobby)
   goals met: 1 of 3
6. (move lobby r4 s)
   deleted: (shakey-at s lobby)
   added: (shakey-at s r4)
   goals met: 1 of 3
7. (switch-on s b1 r4)
   added: (lighted-room r4)
   goals met: 2 of 3
8. (move r4 lobby s)
   deleted: (shakey-at s r4)
   added: (shakey-at s lobby)
   goals met: 2 of 3
9. (move lobby r2 s)
   deleted: (shakey-at s lobby)
   added: (shakey-at s r2)
   goals met: 2 of 3
10. (switch-on s b1 r2)
   added: (lighted-room r2)
   goals met: 3 of 3
